# Target Guided Encoding

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv', usecols=['Survived', 'Cabin'])

In [3]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Cabin     204 non-null    object
dtypes: int64(1), object(1)
memory usage: 14.0+ KB

In [5]:
import numpy as np

In [6]:
df['Cabin'] = np.where(df['Cabin'].isnull(), 'Missing', df['Cabin'])

In [7]:
df['Cabin']

0      Missing
1          C85
2      Missing
3         C123
4      Missing
        ...
886    Missing
887        B42
888    Missing
889       C148
890    Missing
Name: Cabin, Length: 891, dtype: object

In [8]:
df['Cabin'] = df['Cabin'].str[0]

In [9]:
df

     Survived Cabin
0           0     M
1           1     C
2           1     M
3           1     C
4           0     M
..        ...   ...
886         0     M
887         1     B
888         0     M
889         1     C
890         0     M

[891 rows x 2 columns]

In [10]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [11]:
labels = df.groupby(['Cabin'])['Survived'].mean().sort_values(ascending = True).index

In [12]:
Target_Guided = {k : i for i, k in enumerate(labels, 0)}

In [13]:
Target_Guided

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [14]:
df['Cabin_Ordinal'] = df.Cabin.map(Target_Guided)

In [15]:
df

     Survived Cabin  Cabin_Ordinal
0           0     M              1
1           1     C              4
2           1     M              1
3           1     C              4
4           0     M              1
..        ...   ...            ...
886         0     M              1
887         1     B              6
888         0     M              1
889         1     C              4
890         0     M              1

[891 rows x 3 columns]

# Mean Encoding

In [16]:
df

     Survived Cabin  Cabin_Ordinal
0           0     M              1
1           1     C              4
2           1     M              1
3           1     C              4
4           0     M              1
..        ...   ...            ...
886         0     M              1
887         1     B              6
888         0     M              1
889         1     C              4
890         0     M              1

[891 rows x 3 columns]

In [17]:
df.(df.groupby(['Cabin'])['Survived'].mean().to_dict())

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64